/* Title for shut-down alert warning that we're updating Boot Caches */
"Updating Boot Caches" = "Päivitetään käynnistysvälimuisteja";

/* Text of shut-down alert explaining why we aren't shutting down right away */
"Caches necessary for booting are being updated.  System shutdown will proceed once the caches are up to date." = "Käynnistämiseen tarvittavia välimuisteja päivitetään. Järjestelmä sammutetaan, kun välimuistit ovat ajan tasalla.";

/* Title for alert warning in boot≠root that kernel or mkext in memory doesn't match that found on root volume. */
"Inconsistent system files" = "Järjestelmätiedostot eivät vastaa toisiaan";

/* Text of alert warning in boot≠root that kernel or mkext in memory doesn't match that found on root volume. */
"Important system files in memory do not match those on disk. Kernel extensions can not be loaded, and some devices may not work. Resetting your startup disk in System Preferences may help." = "Muistissa olevat tärkeät järjestelmätiedostot eivät vastaa levyllä olevia. Kernel-laajennuksia ei voida ladata ja jotkin laitteet eivät välttämättä toimi. Käynnistyslevyn valitseminen uudelleen Järjestelmäasetuksista voi auttaa.";

/* Title for alert warning the user of a kernel extension whose contents could be replaced with malicious code. */
"System extension cannot be used" = "Järjestelmälaajennusta ei voida käyttää";

/* Text of alert warning the user of a kernel extension whose contents could be replaced with malicious code. In two parts; the filename in question is put in between them. */
"The system extension \"" = "Järjestelmänlaajennus ”";

"\" was installed improperly and cannot be used. Please try reinstalling it, or contact the product's vendor for an update." = "” on asennettu väärin eikä sitä voida käyttää. Yritä asentaa se uudelleen tai hanki tuotteen valmistajalta päivitys.";

/* OK */
"OK" = "OK";

/* Display mode naming related strings. */

"PAL"  = "PAL";
"NTSC" = "NTSC";

"256 Colors" = "256 väriä";
"Thousands"  = "Tuhansia";
"Millions"   = "Miljoonia";
"Trillions"  = "Biljoonia";

"n/a"  = "Ei saatavilla";

"stretched"  = "venytetty";
"simulscan"  = "simulscan";
"interlaced" = "lomitettu";
"external"   = "ulkoinen";


"%%.%ldf Hertz"       = "%%.%ldf Hz";
"%%.%ldf Hertz (%%@)" = "%%.%ldf Hz (%%@)";

"%d x %d"  = "%d x %d";
"%d x %dp" = "%d x %dp";
"%d x %di" = "%d x %di";

"%@"						=	"%@";
"%@ (%@)"					= 	"%@ (%@)";
"%@ (%@, %@)"					= 	"%@ (%@, %@)";
"%@ (%@, %@, %@)"				=	"%@ (%@, %@, %@)";
"%@ (%@, %@, %@, %@)"				=	"%@ (%@, %@, %@, %@)";
"%@ (%@, %@, %@, %@, %@)"			=	"%@ (%@, %@, %@, %@, %@)";

"%%@, %%.%ldf Hz"				=	"%%@, %%.%ldf Hz";
"%%@, %%.%ldf Hz (%%@)"				=	"%%@, %%.%ldf Hz (%%@)";
"%%@, %%.%ldf Hz (%%@, %%@)"			= 	"%%@, %%.%ldf Hz (%%@, %%@)";
"%%@, %%.%ldf Hz (%%@, %%@, %%@)"		=	"%%@, %%.%ldf Hz (%%@, %%@, %%@)";
"%%@, %%.%ldf Hz (%%@, %%@, %%@, %%@)"		=	"%%@, %%.%ldf Hz (%%@, %%@, %%@, %%@)";
"%%@, %%.%ldf Hz (%%@, %%@, %%@, %%@, %%@)"	=	"%%@, %%.%ldf Hz (%%@, %%@, %%@, %%@, %%@)";
